# BarTypeDiameterOptions Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
BarTypeDiameterOptions Constructor
BarTypeDiameterOptions Class See Also
---
Constructs a new BarTypeDiameterOptions with default settings.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018.1
# Syntax
C#
---
```text
public BarTypeDiameterOptions()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
BarTypeDiameterOptions()
```

# See Also
BarTypeDiameterOptions Class
BarTypeDiameterOptions Overload
Autodesk.Revit.DB Namespace